[{"id": "lmxszc", "title": "Thanks for everything, Mr.doob.", "score": 171, "url": "https://i.redd.it/8gxlm1wd0bi61.png", "body": ""}, {"id": "mk6fzz", "title": "I used Blender and ThreeJS to create a portfolio / personal website.", "score": 142, "url": "https://v.redd.it/8hxjrgnif8r61", "body": ""}, {"id": "p5jemk", "title": "Was in need of an “Annotation” component in ThreeJS. Surprisingly there were no ready to use libraries. I found Manuel Wieser’s article (comments) about the topic and took it a few steps further. Should I release this as a library?", "score": 116, "url": "https://v.redd.it/g5dmtomrwqh71", "body": ""}, {"id": "ke5s03", "title": "Working on a three.js FPS - some in-game screenshots", "score": 112, "url": "https://www.reddit.com/gallery/ke5s03", "body": ""}, {"id": "oydqs6", "title": "Working on a globe for a client like the one on GitHub’s homepage. Based on Nick Jones’ article (in comments) about something similar for Stripe. Need critique", "score": 109, "url": "https://v.redd.it/pwmg1heq9if71", "body": ""}, {"id": "kyccx3", "title": "I have compiled a template for react-three-fiber", "score": 109, "url": "https://www.reddit.com/r/threejs/comments/kyccx3/i_have_compiled_a_template_for_reactthreefiber/", "body": "I believe most of you would have heard about react-three-fiber already (r3f). It is a framework which provides react components for threejs and makes compilation of a threejs project much faster and cleaner.\n\nI have been working for a while on r3f and this is one of the project that i worked on that I am allowed to share with you people:\n\n[https://webxr.autovrse.in/3d-automotive-configurator](https://webxr.autovrse.in/3d-automotive-configurator)\n\n&#x200B;\n\n I have compiled a template with the basic setup and some more useful packages to help people start off with react three fiber with a headstart.\n\n**You can find the template here**: [https://github.com/Epiczzor/r3f-template](https://github.com/Epiczzor/r3f-template)"}, {"id": "lqd4br", "title": "Feels like a PhD in ThreeJs - Created a tool for 3D mockups & animations", "score": 92, "url": "https://v.redd.it/03qzcmxyq6j61", "body": ""}, {"id": "pouvtj", "title": "Made my first site using threejs / r3f / react native web", "score": 81, "url": "https://v.redd.it/g6q44b7edpn71", "body": ""}, {"id": "pdgmia", "title": "Finally stopped procrastinating and taught myself how to make multi pass shaders. A Simplex Noise based flow field (Curl Noise). Will write about it soon!", "score": 80, "url": "https://v.redd.it/ndg7kafjl5k71", "body": ""}, {"id": "ncikho", "title": "I Created a library to very easily include many types of Procedural Noise functions in your Shaders! Can be used for anything really, I use them for HeightMap generation. GitHub in comments", "score": 80, "url": "https://v.redd.it/tlgjfae7e5z61", "body": ""}, {"id": "agbqv6", "title": "Another attempt with three js.", "score": 77, "url": "https://v.redd.it/x7jtqqi9uma21", "body": ""}, {"id": "nqjvsj", "title": "My first data visualization project in three.js. Crowd animations are made on the GPU. Link & Github in comment", "score": 74, "url": "https://v.redd.it/scwxrca87u271", "body": ""}, {"id": "m9ydg5", "title": "Browser-Based Architecture Visualization. What do you think?", "score": 75, "url": "https://v.redd.it/kjiip5bqaeo61", "body": ""}, {"id": "lpldj1", "title": "Face filters made with three (link / source in comments)", "score": 72, "url": "https://v.redd.it/qm7ig7zag0j61", "body": ""}, {"id": "p8q87a", "title": "Was recreating these procedural waves for my portfolio site, though I’d write about how to make them with ThreeJS. Article in comments!", "score": 70, "url": "https://v.redd.it/8wq2oms6bpi71", "body": ""}, {"id": "pbkiix", "title": "Web based drone synth (ThreeJS + GLSL + ToneJS)", "score": 67, "url": "https://i.redd.it/k6kbbrrkkkj71.png", "body": ""}, {"id": "o4oia9", "title": "Just made a portfolio site with embedded interactive ThreeJS components. Absolutely love this library.", "score": 66, "url": "https://i.redd.it/2o5ni7mn7k671.jpg", "body": ""}, {"id": "nm8q81", "title": "#webar library to add #handTracking to your Three.js projects: https://github.com/WebAR-rocks/WebAR.rocks.hand", "score": 62, "url": "https://v.redd.it/nf3a4cs2bo171", "body": ""}, {"id": "kvxzyz", "title": "Using GPGPU particles to turn GLTF model into a cool interactive particle model. Also retains color from materials import. Of course made with threejs", "score": 60, "url": "https://v.redd.it/9pxmrqhd7ya61", "body": ""}, {"id": "mai5d3", "title": "'Discover Three.js' put on hold, probably permanently.", "score": 58, "url": "https://www.reddit.com/r/threejs/comments/mai5d3/discover_threejs_put_on_hold_probably_permanently/", "body": "I got the email this morning:  \n\n\n \n\n# Hello everyone,\n\nI'm writing to let you know that I'm putting Discover three.js on hold, most likely permanently. It's been an amazing project to work on and I've learned so much and met so many great people since I began writing the book. However, all good things end and this one is finishing sooner and shorter than originally planned. Don't worry though - the existing chapters are not going anywhere. They have been updated to the most recent version of three.js (r126) and I will continue to update them every couple of months. I also plan to rework some of my unpublished material and upload that when time permits.\n\nOver the past year, a combination of personal factors and ongoing global issues left me with less time than I needed to make decent progress on the book. Last December I finally decided to take a break for a few weeks and re-evaluate the project. I spent some of this time doing research and improving my workflow, and while doing this I realized there have been big changes to the three.js ecosystem over the past year. When I looked further into these I realized that many of my reasons for writing Discover three.js are no longer as important as they were when I started.\n\nThese ecosystem changes are exciting and fall into two categories: learning materials, and code. Let me take a few moments now to introduce them and explain why they led me to decide to stop writing the book.\n\nWhen I first started using three.js, there were many pain points to using the library, and the biggest of these were the incomplete documentation and out-of-date tutorials and books. Since then the docs have improved a lot, but many tutorials and books on three.js still use old and outdated versions. Due to the unusual versioning system that three.js uses, it's not clear when a tutorial or book becomes out of date and this leads to a lot of confusion for new users. This is what originally inspired me to start writing Discover three.js. I wanted to fill a gap in the available documentation and provide a clear learning path for new users. However, since then, some amazing new tutorials and courses have been released, such as [three.js Fundamentals](https://threejsfundamentals.org/), which I'm happy to recommend.\n\nMore importantly to my decision, the code ecosystem surrounding three.js has grown in leaps and bounds over the past year, led by the amazing [Poimandres](https://github.com/pmndrs) collective behind [React-three-fiber](https://github.com/pmndrs/react-three-fiber) (R3F), [Drei](https://github.com/pmndrs/drei), [React-three-ally](http://react-three-a11y/), and lots more (and I should also mention [vanruesc/postprocessing](https://github.com/vanruesc/postprocessing) and [Troika three-text](https://protectwise.github.io/troika/troika-three-text/), both of which I'm a big fan of). As you can probably guess, most of this is rather React-centric. However, R3F is rapidly becoming the most common way to use three.js since it abstracts away so much of the busywork involved in creating a three.js app, and because of this, R3F lets you start creating beautiful 3D scenes much faster... as long as you know React, that is.\n\nThis left me in a quandary. Discover three.js is supposed to be a book that will teach you the best way to create 3D websites, not an exhaustive book on 3D graphic theory (there are already loads of amazing computer graphics books - some even using three.js - and it was never my goal to write another one). And yet, more and more I'm coming to believe that using pure three.js is not the fastest or best way to create a modern 3D website, in most cases. Currently, R3F is, and I hope it will inspire similar non-React projects in the future. This left me writing a book that doesn't teach the tooling that I now use and recommend.\n\nAs a result, I now feel I would be better off putting my energy into new projects. Saying goodbye to an unfinished project that I've worked so hard on is bittersweet, but it's an important step for me to take. As John Cleese would say, [Adopt, Adapt, and Improve](https://www.youtube.com/watch?v=MG9Ql1Wyxbg).\n\n## The Future of Discover three.js\n\nFundamental concepts like lighting, geometry, and mathematics work the same way no matter how you are building an app, and I still believe that anyone who wants to learn three.js should learn the basics of putting a scene together using pure three.js. I also still believe that Discover three.js in its current form is one of the best resources for learning those basics, so the existing chapters are not going anywhere. They form a complete beginner-friendly tutorial series spanning somewhere around 70,000 words, and as I mentioned above, I will keep them up to date with new three.js releases.\n\nI'm also open to the idea of open-sourcing the project. The book is written in markdown and compiled with [Hugo](https://gohugo.io/), and if anyone is interested in continuing the book please get in touch.\n\n## Thank you for your support\n\nSo for now, this is goodbye. Thank you to everyone who has reached out to me since I started writing this book with kind words and support, and special thanks to everyone who proofread the existing chapters. You are all awesome!\n\nFinally, a couple of months ago I added a Buy me a Coffee link to the chapters in the book. I've taken this down now - many thanks to anyone who bought me a coffee. However, I did say that the money was going to be used to write the book, so I'm more than happy to refund anyone who contributed. Drop me a message if you want your coffee back :)\n\nOnwards and upwards. Wherever in the world you are, I hope you're having a great day.\n\n**Lewy**"}, {"id": "kbtm2b", "title": "After 3 long years, jamir is almost complete, thanks to three.js", "score": 60, "url": "https://gfycat.com/hilariousdefensivebabirusa", "body": ""}, {"id": "ov2eeg", "title": "I created an alternative to React-Three-Fiber. A paper-thin (~800 bytes) and position-aware wrapper for ThreeJS in React - React-Three-Paper. Find it in the comments!", "score": 56, "url": "https://i.redd.it/ezbmr67fuhe71.png", "body": ""}, {"id": "nuccd7", "title": "Waves, Clouds, Particles and Animations - All Procedural. Web-Based Demo in comments.", "score": 57, "url": "https://v.redd.it/o1zt4nnjgu371", "body": ""}, {"id": "mx0pps", "title": "Made a Carousel using ThreeJS", "score": 56, "url": "https://v.redd.it/mkxlwtbzlyu61", "body": ""}, {"id": "lfchzj", "title": "Hey all, tried making an MMORPG in Three.js, check it out if you're interested!", "score": 58, "url": "https://youtu.be/IptkgFOoci0", "body": ""}, {"id": "fizfm1", "title": "Cannon.js, the physics library, is maintained again", "score": 60, "url": "https://www.reddit.com/r/threejs/comments/fizfm1/cannonjs_the_physics_library_is_maintained_again/", "body": "The original repo has long been unmaintained, we have forked it, upgraded it to esm so that it can be tree-shaken, types are in the making, bugfixes in the original repo are being merged, and some new corrections, convexpolyhydrons are working properly in this version for instance. We also accept PR’s and issues.\n\nPackage size (all features included) is currently 33kb. For a simple case (World, Body, Box, Vecs, NaiveBroadphase) it’s about 20.\n\n[https://github.com/react-spring/cannon-es](https://github.com/react-spring/cannon-es)\n\nPS. React users can use an easier abstraction running in a web worker: [https://github.com/react-spring/use-cannon](https://github.com/react-spring/use-cannon)"}, {"id": "gcx1k0", "title": "Getting 60,000 AI Agents Pathfinding at 60fps, source & tutorial", "score": 55, "url": "https://v.redd.it/5u9v2tooulw41", "body": ""}, {"id": "npsnbc", "title": "Added 3D Noise and Blend Modes to my WebGL Noise library (gl-Noise)! Used it to make a Planet Generator. Demo and GitHub in comments!", "score": 55, "url": "https://v.redd.it/3mqq4gi5cn271", "body": ""}, {"id": "in5n9p", "title": "Latest video of my three.js game Jamir", "score": 53, "url": "https://v.redd.it/yqdfs7f17dl51", "body": ""}, {"id": "kgh1fw", "title": "Messing around with instancing and canvas-sketch. Code in comments", "score": 51, "url": "https://v.redd.it/wdz3vf4tr7661", "body": ""}, {"id": "jk242w", "title": "New experiment with WebGL. Instances, selective physics, flipbooks, postprocesses, tonemapping, contrast, bloom, blur, anamorphic dof, new grain and noise materials, motion blur. ~60fps on 2070 and 1080 but 19-20fps on 1060. Planning to dig even deeper this weekend.", "score": 48, "url": "https://v.redd.it/067jky0i5yv51", "body": ""}, {"id": "7g2wfi", "title": "Infinitown - A WebGL Experiment to create a procedural city", "score": 49, "url": "http://demos.littleworkshop.fr/infinitown", "body": ""}, {"id": "eiidss", "title": "I am still working on my three.js online browser game and wanted to share some latest screenshots", "score": 46, "url": "https://i.redd.it/trtea2je66841.jpg", "body": ""}, {"id": "gge90b", "title": "THREE.js Retrowave/Synthwave scene made for my upcoming portfolio", "score": 51, "url": "https://youtu.be/hzHsj6XvU9s", "body": ""}, {"id": "e9lsjc", "title": "I created basic sculpting feature for my ongoing project", "score": 45, "url": "https://v.redd.it/f8i6eu90f6441", "body": ""}, {"id": "b7bhwg", "title": "Latest screenshots of my Three.js multiplayer game Jamir, i am working on around 1.5 years in my spare times", "score": 48, "url": "https://i.redd.it/0nj04aa4h9p21.png", "body": ""}, {"id": "khhzvk", "title": "Hey all, made a tutorial on making a little 3d RPG", "score": 46, "url": "https://youtu.be/SBfZAVzbhCg", "body": ""}, {"id": "jnnshn", "title": "Patiently waiting. Another experiment with WebGL | Threejs. Morphs instead of Alembic. Projection upgrade. Emitting particles. Updated rays. Blurry particles. Sprites/Flipbook. Simple bones animation and a lot of post processes. Not optimized. Minimum reqs GTX1080/RTX2070 on 2.5k/4k (35-40fps). WIP.", "score": 47, "url": "https://v.redd.it/xxnvnm7uo4x51", "body": ""}, {"id": "kcyha8", "title": "Hey all, made a little video on shaders in Three.js", "score": 45, "url": "https://www.youtube.com/watch?v=C8Cuwq1eqDw", "body": ""}, {"id": "ixs84c", "title": "Burning Person WIP", "score": 46, "url": "https://v.redd.it/zx4vaylyjqo51", "body": ""}, {"id": "oojdyv", "title": "Just figured out how to render 1M+ particles in ThreeJS using Points and Shaders and wrote about it!", "score": 42, "url": "https://blog.farazshaikh.com/stories/rendering-1-m-particles/", "body": ""}, {"id": "ibhj6s", "title": "Extend Three.js standard materials with your own vertex shaders! CustomShaderMaterial is an extension of the Three.js standard material library. It offers a way to add a custom vertex shader to the already existing materials in Three.js. Link in Comments! Thank You! :)", "score": 41, "url": "https://i.redd.it/1idnpfftblh51.gif", "body": ""}, {"id": "jkxjhz", "title": "Projection WebGL / Threejs test. A bit updated noise and blur postprocesses, tested material displacement animation and simple bones animation. More sprites materials and etc. WIP.", "score": 41, "url": "https://v.redd.it/rpt9ye0op8w51", "body": ""}, {"id": "jf7q8p", "title": "Continue experimenting with Threejs wip", "score": 39, "url": "https://v.redd.it/ee9d94dk7eu51", "body": ""}, {"id": "mkuw32", "title": "Hey all, doing a series on procedural planets, latest is 3D Mesh Generation, Gaps, and Stitching", "score": 39, "url": "https://youtu.be/sXFxfqGPR-c", "body": ""}, {"id": "olbrcq", "title": "My Custom Shader Material now supports (almost) all standard material types and all standard material properties including shadows and vertex colors! It also supports custom diffuse color via Fragment Shader along with custom Vertex Shaders with standard materials as a base. Find it in the comments!", "score": 39, "url": "https://v.redd.it/34c71yrjyib71", "body": ""}, {"id": "mgqf1g", "title": "[OC] model-browser is a tool for browsing local 3D model files. You can install it via npm. Details in comments.", "score": 40, "url": "https://v.redd.it/2icjtfp3g8q61", "body": ""}, {"id": "lsf38j", "title": "New project to explore sounds, rhythms and music created with a 3D physics engine. Using Three.js, Ammo.js, Vue 3, VueX and PrimeVUE components. Written in Typescript.", "score": 39, "url": "https://v.redd.it/aqdsbvnrgoj61", "body": ""}, {"id": "khqd2s", "title": "Nebula is a fully featured particle system designer for three", "score": 42, "url": "https://www.reddit.com/r/threejs/comments/khqd2s/nebula_is_a_fully_featured_particle_system/", "body": "https://i.imgur.com/vAVSwfw.jpg\n\nI’m very proud today to officially introduce [**Nebula**](https://getnebula.app) for desktop and its open source counterpart [`three-nebula`](https://three-nebula.org) - a WebGL based particle system **designer** and **engine** for [`three`](https://threejs.org).\n\n**Nebula** was created as a branch from my game/game-engine creation project; [Project GoldScript](https://projectgoldscript.com). I made it because I couldn’t find any way to visually and interactively create rich, eye catching particle systems for my engine that could potentially match those made for AAA games.\n\nWith **Nebula**, you can create eye catching particle systems, save them as JSON and render them in any website or app that supports WebGL using `three` and `three-nebula`. Particles can be rendered direct to the GPU making for some extremely performant effects.\n\nAt present the app is in alpha and there may be issues, from UI bugs to performance problems, but I’m pleased enough with it to let people start playing around and see what kinds of things the community can create. There’s also no fully fleshed out user guide or manual right now because I’m sure users will have a lot of feedback about the first draft for the UI. I’d rather wait until I’ve addressed the first round of major concerns before investing time into writing a guide.\n\nI’ve got a lot of plans for the future, such as an online space where people can upload, view & download other people’s particle systems and bunch of other advanced features that I’ll talk about soon.\n\nFor now, if you have questions, comments or want to simply discuss things, please head over to the repo’s [discussions](https://github.com/creativelifeform/three-nebula/discussions) page in Github. If you’d like to keep up to date with the latest changes and feature additions, please follow [the official app account](https://twitter.com/getnebula) on Twitter."}, {"id": "mfm0a7", "title": "Learning three js since few weeks now, so tried to make this mouse wheel controlled Carousel as an exercise. Custom shaders for that effect on image.", "score": 40, "url": "https://v.redd.it/hr60tq0awxp61", "body": ""}, {"id": "gt01f1", "title": "Messing around with fake atmospheric scattering for planet rendering", "score": 41, "url": "https://v.redd.it/1x5viu5ber151", "body": ""}, {"id": "kujb8g", "title": "Beginners guide on Three.js: Learn to build a 3D game with physics", "score": 38, "url": "https://youtu.be/hBiGFpBle7E", "body": ""}, {"id": "f58f1n", "title": "Interactive curtain (polylines and verlet constraints)", "score": 39, "url": "https://v.redd.it/n8k3zkeafhh41", "body": ""}, {"id": "af7ng4", "title": "Three.js turned r100!", "score": 40, "url": "https://github.com/mrdoob/three.js/releases/tag/r100", "body": ""}, {"id": "lp98ru", "title": "A bit of juice with post processing in WebGL/Threejs", "score": 37, "url": "https://v.redd.it/owgvn6tqxwi61", "body": ""}, {"id": "io7y6o", "title": "Flexbox spec for Threejs, making 3d content responsive", "score": 38, "url": "https://twitter.com/0xca0a/status/1302969147211558912", "body": ""}, {"id": "gwrzbm", "title": "three-mesh-ui now supports overflow: \"hidden\" (like CSS) | Live demo in comment", "score": 37, "url": "https://i.redd.it/9wyokw0n0z251.gif", "body": ""}, {"id": "gaa83b", "title": "Add VR UIs to your Three.js project. Padding, word-wrap, text-align. Repo in comment 👀", "score": 37, "url": "https://i.redd.it/uux41pyolrv41.gif", "body": ""}, {"id": "fkl1sq", "title": "IK Rigs + ProtoRigs + Three.js = Effing Yea!", "score": 40, "url": "https://i.redd.it/ocsmpiurkdn41.gif", "body": ""}, {"id": "exlhmx", "title": "Open source THREE.js browser RPG game engine in the making", "score": 37, "url": "https://www.youtube.com/watch?v=xYQ6FZOfrqY", "body": ""}, {"id": "nazl87", "title": "Dance - WGL002", "score": 36, "url": "https://v.redd.it/8mzqg40j9ry61", "body": ""}, {"id": "o91u4u", "title": "CrookTown - Working on a GTA style game with Threejs/Cannonjs, you can tune cars, get chased by cops, shoot weapons, fly planes/helis, still in very early development, if anyone would like to follow the development you can join here: https://discord.gg/juYbPmmwzg or http://crook.town/ :) <3", "score": 36, "url": "https://www.reddit.com/gallery/o91u4u", "body": ""}, {"id": "eea07o", "title": "My ongoing game project. Tools: Three.JS, Webpack, Blender 3d, Gimp.", "score": 35, "url": "https://v.redd.it/hxyhpaoqx8641", "body": ""}, {"id": "nz2t1e", "title": "I am a 48 hour jam game entirely with THREE.js !", "score": 34, "url": "https://i.redd.it/wau4qmqvu2571.gif", "body": ""}, {"id": "lvar12", "title": "Hey all, tried improving my first Minecraft attempt, check it out!", "score": 34, "url": "https://youtu.be/MQt0exToUEY", "body": ""}, {"id": "laadhd", "title": "Plockle: VR Block puzzle game that can be played for free in the browser. Built /w threejs", "score": 32, "url": "https://v.redd.it/mxqj4k81uwe61", "body": ""}, {"id": "k54q3v", "title": "The Interactive Map I'm working on is taking shape! 'Polyp'!", "score": 32, "url": "https://v.redd.it/8axit9yt6q261", "body": ""}, {"id": "jdsbjx", "title": "Always wanted to try webgl threejs but never had time to learn it. Pandemic made some room in the schedule, fist couple experiments.", "score": 30, "url": "https://www.reddit.com/gallery/jdsbjx", "body": ""}, {"id": "pxsh0o", "title": "Procedurally generated solar systems", "score": 32, "url": "https://www.reddit.com/gallery/pxsh0o", "body": ""}, {"id": "o4wr8g", "title": "Hey all, tried making a Star-Wars Battlefront II style game, w/ GamePad support", "score": 34, "url": "https://youtu.be/XkvH7z4GxHM", "body": ""}, {"id": "lqosgu", "title": "An example of threejs use in larger professional work. (since people sometimes ask if it is viable)", "score": 32, "url": "https://vimeo.com/400310279", "body": ""}, {"id": "kod28u", "title": "I made a system wallpaper using threejs", "score": 31, "url": "https://v.redd.it/h7b6lin1oq861", "body": ""}, {"id": "gcpbv6", "title": "neon grapple hook swinging game in three.js", "score": 31, "url": "https://v.redd.it/dj4k7f5sfjw41", "body": ""}, {"id": "ak0v4p", "title": "Completed dropship scene for my Three js browser game Jamir", "score": 30, "url": "https://v.redd.it/wez59u5zrrc21", "body": ""}, {"id": "pvdrle", "title": "A linear timeline of Star Wars media created using threejs", "score": 31, "url": "https://v.redd.it/wky9i2754op71", "body": ""}]